Tutorial4/SquaredDouble/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          41697;
        startFace       1990648;
    }
    drafttube
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16660;
        startFace       2032345;
    }
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          122262;
        startFace       2049005;
    }
)

// ************************************************************************* //
